<template>
	<section id="protocol">
	<header-section title="用户服务协议"></header-section>
		  <div class="protocol">
		  	<p>码上花《用户服务协议》（以下简称“本协议”）是由广州真知码信息科技有限公司（以下简称“真知码”）在提供客户端软件“码上花”的服务时与码上花用户达成的关于使用码上花软件服务的各项规则、条款和条件。如果您访问码上花软件购物时，您便接受了本协议。</p>

<p class="mat20">请仔细阅读本协议中所述的所有规则、条款和条件，包括被本协议提及而纳入本协议的其他条款和条件。建议阅读本协议时，同时阅读本协议中提及的其他网页所包含的内容，因为其可能包含适用于码上花用户的其他条款和条件。</p>

<p class="title mat20">一、用户注册：</p>

<p>1. 用户注册是指用户登陆码上花软件，按要求填写相关信息并确认同意本协议的过程。用户因进行交易、获取有偿服务等而发生的所有应纳税赋由用户自行承。</p>

<p class="mat20">2. 码上花用户必须是具有完全民事行为能力的自然人，或者是具有合法经营资格的实体组织。无民事行为能力人、限制民事行为能力人以及无经营或特定经营资格的组织不得注册为码上花用户或超过其民事权利或行为能力范围与码上花进行交易，如与码上花进行交易的，则本协议自始无效，真知码有权立即停止与该用户的交易、注销该用户账户，并有权要求其承担相应法律责任。</p>

<p class="mat20">3. 每位用户只允许在码上花拥有一个账户，如有证据证明或码上花有理由相信用户存在恶意注册多个账户的情形，码上花有权采取取消订单、冻结或关闭账户等措施，给码上花造成损失的，用户还应承担赔偿责任。</p>

<p class="title mat20">二、商品交易：</p>

<p>1. 商品交易原则：</p>

①平等原则：用户和码上花在交易过程中具有同等的法律地位。<br >

②自由原则：用户享有自愿向码上花购买商品的权利，任何人不得非法干预。<br >

③公平原则：用户和码上花行使权利、履行义务应当遵循公平原则。<br >

④诚实信用原则：用户和码上花行使权利、履行义务应当遵循诚实信用原则。<br >

⑤依合同履行义务原则：用户向码上花购买商品时，用户和码上花皆有义务根据本协议的约定完成该等交易（法律或本协议禁止的交易除外）。<br >

<p class="mat20">2. 码上花真品上展示的商品信息（如商品名称、价格、功能等信息）仅构成要约邀请，用户通过码上花订购商品，订单即为购买商品的要约。码上花向用户发出订单确认信息或将直接将商品发送至用户指定地址时，构成码上花对该订单的承诺，此时买卖合同即告成立。</p>

<p class="mat20">3. 用户在此同意并确认，码上花有保留在发现码上花软件上显示的商品信息错误或缺货的情况下，撤回或修改该等信息的权利，并保留对商品订购数量的限制权。用户下订单即表示其对在订单中提供的信息的真实性负责。</p>

<p class="mat20">4. 码上花软件上显示的每一商品的价格都包含了增值税（按照法定税率）。送货费用根据用户选择的送货方式另外进行结算。码上花有权更改上述有关价格和送货费用的信息。</p>

<p class="title mat20">三、用户的权利和义务：</p>

<p>1. 用户应妥善保管本人的账户名、密码、绑定的手机号码、手机校验码等与码上花有关的一切信息。用户应确保不向其他任何人泄露账户信息和密码。对于因密码泄露所致的损失，由用户自行承担。如用户发现有他人冒用或盗用本人账户及密码或任何其他未经合法授权之情形时，应立即以有效方式通知码上花，要求其暂停相关服务。同时，用户理解码上花对相应的请求采取行动需要合理期限，在此之前，码上花对已执行的指令及（或）所导致的用户损失不承担任何责任。</p>

<p class="mat20">2. 用户有权根据本协议的规定以及码上花软件上发布的相关规则在码上花软件上查询商品信息、订购具体商品、发表使用体验、参与商品讨论、邀请关注好友、上传商品图片、参加码上花的有关活动（如适用，下同），以及享受码上花提供的其它服务。</p>

<p class="mat20">3. 有权要求码上花对用户提供的有关信息予以保密，但法律法规另有规定、用户予以授权、或本协议另有约定的除外。</p>

<p class="mat20">4. 用户有义务在注册和订购时提供自己的真实资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及真实性，保证码上花可以通过上述联系方式与用户本人进行联系。同时，用户也有义务在相关资料发生变更时及时更新有关注册资料。用户保证不以他人资料在码上花进行注册和购买商品。</p>

<p class="mat20">5. 用户不得以出租、转借或以其他方式将使用分期付款服务过程中的相关账户、密码、数字证书、身份证信息、手机号码、银行卡信息、住址、邮箱等信息交由任何其他第三方使用，否则由此导致的损失及相关后果由用户承担。</p>

<p class="mat20">6. 用户应当保证在码上花软件购买商品过程中遵守诚实信用原则，不扰乱网上交易的正常秩序。</p>

<p class="mat20">7. 用户享有言论自由权利，并拥有适度修改、删除自己发表的文章的权利。 用户不得在码上花发表包含以下内容的言论：</p>

①反对宪法所确定的基本原则，煽动、抗拒、破坏宪法和法律、行政法规实施的；<br >

②煽动颠覆国家政权，推翻社会主义制度，煽动、分裂国家，破坏国家统一的；<br >

③损害国家荣誉和利益的；<br >

④煽动民族仇恨、民族歧视，破坏民族团结的；<br >

⑤任何包含对种族、性别、宗教、地域内容等歧视的；<br >

⑥捏造或者歪曲事实，散布谣言，扰乱社会秩序的；<br >

⑦宣扬封建迷信、邪教、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；<br >

⑧公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；<br >

⑨损害国家机关信誉的；<br >

⑩其他违反宪法和法律行政法规的。<br >

<p class="mat20">8. 用户在发表使用体验、商品讨论或图片等内容时，除遵守本条款外，还应遵守码上花软件的其他相关规定。</p>

<p class="mat20">9. 未经真知码同意，禁止用户在码上花软件上发布任何形式的广告。若用户违反协议约定发布广告，真知码有权删除；对码上花软件及真知码造成损失的，真知码有权要求用户赔偿损失。</p>

<p class="mat20">10. 用户享有码上花对分期付款服务所承诺的各项服务，有权监督服务质量，并对不符合质量的服务进行投诉。</p>

<p class="mat20">11. 用户应仔细阅读并充分理解本协议、重要提示及其他所有相关资料和文件，并持续关注码上花向用户公示的协议修订，以及对上述资料和文件的修改和变更。</p>

<p class="mat20">12. 用户不得以非法套现、非法获取不正当利益为目的，通过非法、不正当操作或与非法商户、非法中介组织、其他第三方等串通合作，违反码上花分期付款服务平台规则及各项管理规定，否则由此导致的损失及相关后果由用户承担。</p>

<p class="mat20">13. 按照码上花制订并公布的收费标准支付服务费及其他费用。</p>

<p class="mat20">14. 用户声明在接受本协议时本人不存在任何违反法律、法规与规章的行为或情形；若用户的上述声明虚假或者上述承诺未被履行，或者用户可能发生违法违规风险，码上花有权提前终止本服务或采取本协议约定或法律允许的其他救济措施。</p>

<p class="title mat20">四、分期付款业务：</p>

<p>码上花注册会员（以下简称“用户”）在选购分期付款商品时，所涉及的付款方式、付款额度以及服务费用的收取与结算等等，须遵守中国建设银行股份有限公司（以下简称“建行”）所规定的相关要求和规范，详细内容请参考建行实际公布的相关准则和条例。</p>

<p class="title mat20">五、码上花的权利和义务：</p>

<p>1. 真知码有义务在现有技术上维护整个交易软件的正常运行，并努力提升和改进技术，使用户交易活动得以顺利进行；</p>

<p class="mat20">2. 对用户在注册和使用码上花交易软件中所遇到的与交易或注册有关的问题及反映的情况，真知码应及时作出回复；</p>

<p class="mat20">3. 对于用户在码上花软件上作出下列行为的，真知码有权作出删除相关信息、终止提供服务等处理，而无须征得用户的同意：</p>

<p class="mat10">① 真知码有权对用户的注册信息及购买行为进行查阅，发现注册信息或购买行为中存在任何问题的，有权向用户发出询问及要求改正的通知或者作出删除等处理；</p>

<p class="mat10">②用户违反本协议规定或有违反法律法规和地方规章的行为的，真知码有权停止传输并删除其信息，禁止用户发言，限制用户订购，注销用户账户并按照相关法律规定向相关主管部门进行披露。</p>

<p class="mat10">③对于用户在真知码进行的下列行为，真知码有权对用户采取删除其信息、禁止用户发言、限制用户订购、注销用户账户等限制性措施：包括发布或以电子邮件或以其他方式传送存在恶意、虚假和侵犯他人人身财产权利内容的信息，进行与购物无关或不是以购物为目的的活动，试图扰乱正常购物秩序，将有关干扰、破坏或限制任何手机软件、硬件或通讯设备功能的软件病毒或其他手机代码、档案和程序之资料，加以上载、发布、发送电子邮件或以其他方式传送，干扰或破坏码上花软件和服务或与码上花软件和服务相连的服务器和网络，或发布其他违反公共利益或可能严重损害真知码和其它用户合法利益的信息。</p>

<p class="mat20">4. 用户在此免费授予真知码永久性的独家使用权(并有权对该权利进行再授权)，使真知码有权在全球范围内(全部或部分地) 使用、复制、修订、改写、发布、翻译和展示用户公示于码上花软件的各类信息，或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。（扩大客户信息授权范围）</p>

<p class="mat20">5. 对不遵守有关法律法规、本协议等规定的用户（包括但不限于用户未在规定期限内支付应付款项的）或者码上花有理由认为用户不再符合分期付款方式付款的使用条件时，码上花有权基于合理怀疑拒绝用户继续使用信用付款方式进行付款，并由码上花提醒客户，如客户在合理期限内未向码上花提供充分证据以消除该等合理怀疑的，码上花有权提前暂停分期付款服务而不必事先通知用户本人。用户对码上花停止其分期付款服务的使用有异议的，需要按照码上花的要求，依据码上花所提供的客户服务等方式向码上花提供充分证据以消除该等合理怀疑，具体异议提出方式及解决方式以平台规则约定为准。</p>

<p class="mat20">6. 为有针对性地向用户提供新的服务、机会以及优惠信息等，用户了解并同意码上花依据用户在码上花已经认可的促销信息推送方式（包括但不限于电子邮件、站内消息和手机短信等）向用户通知这些信息。</p>

<p class="mat20">7. 码上花有权通过信函、短信、电子邮件、电话、上门或司法途径等方式向用户催收应付款项。用户同意码上花有权授权第三方通过手机短信、站内信、电话提醒、上门外访和寄送信函等方式，督促用户按时支付所有应付款项，包括但不限于消费本金、分期服务费、违约金等，其中手机短信、站内信、微信在发出时即视为送达。</p>

<p class="mat20">8. 码上花保留对用户收取费用的权利，且有权在有关法律法规允许的范围内，结合分期付款和业务发展等实际情况，维护和更新分期付款服务的适用范围、各项使用功能、服务范围和收费标准，并通过公告等方式及时通知用户。</p>

<p class="mat20">9. 码上花有权根据相关适用法律，将在分期付款服务关系建立和存续期间获得的用户的个人基本信息、债务信息、信用信息（即适用法律规定的对乙方信用状况的客观状态）等有关信息提供给相关政府管理部门、行业监督管理机构或其他合法设立的征信管理机构等。</p>

<p class="mat20">10.码上花有义务接受用户对于分期付款方式付款相关信息的查询服务，将向用户通过码上花网站（公告方式）、电子邮件、手机短信等向用户公示分期付款产品和服务、重要提示、服务协议、计费标准等信息。</p>

<p class="mat20">11.码上花有建立针对分期付款服务的公平、有效的投诉制度的义务，并公开投诉程序和投诉电话。对用户关于账务情况的查询和改正要求给予答复。</p>

<p class="mat20">12.码上花将根据行业规则、国家相关法律法规及业务发展情况为用户提供相关的优惠活动或服务，活动或服务规则以届时码上花相关页面公布的内容为准。</p>

<p class="mat20">13.码上花对用户的个人基本信息、债务信息、信用信息有权予以保留，码上花对该等信息负有保密的义务，除根据相关法律法规、本协议的相关约定、或出于为用户提供更好的信用付款服务之目的、需将用户信息进行对外提供的情形之外，未经用户允许，码上花不得擅自将用户信息披露或提供给其他第三方。</p>

<p class="mat20">14.码上花根据分期付款服务平台管理制度、风险管理规定、相关法律法规要求等，从用户的付款金额、收货地址、联系方式等方面进行综合判断后如认为用户存在交易异常、个人信息异常等情形时，码上花可中止或调整向用户提供分期付款服务；为保障用户的交易安全，码上花有权要求用户提供相关材料或要求用户配合码上花其他风控措施供码上花核实验证，如用户拒绝相应材料或拒绝配合码上花的风控措施，导致码上花无法核实交易正常，则码上花有权对用户的该笔订单采取交易拦截等方式，并可中止、终止向用户提供信用付款服务。</p>

<p class="mat20">15.通知：针对用户使用分期付款消费成功、用户对分期付款还款成功等通知消息，码上花将通过短信或微信等方式通知用户。</p>

<p class="title mat20">六、软件规则、修改和可分性：</p>

<p>1. 价格变动规则。真知码将尽最大努力保证用户所购商品与软件上公布的价格一致，但价目表并不构成要约。尽管做出最大的努力，真知码商品中的一小部分商品可能会有定价误差。如果发现因此产生错误定价，真知码将采取下列措施之一：如果某一商品的正确定价低于错误定价，真知码将按照较低的定价向用户销售该商品。如果某一商品的正确定价高于错误定价，真知码会根据具体情况，在交付商品前联系用户寻求指示, 或者取消订单并通知用户。</p>

<p class="mat20">2. 商品缺货规则。用户订购的商品如果发生缺货，用户和真知码皆有权取消该订单。真知码可对缺货商品进行预售登记，真知码会尽最大努力在最快时间内满足用户的购买需求，当缺货商品到货，真知码将第一时间通过邮件、短信或电话通知用户，方便用户进行购买。预售登记并不做订单处理，不构成要约。</p>

<p class="mat20">3. 邮件/短信服务规则。当用户访问真知码或给真知码发送电子邮件时，用户同意用电子方式与真知码进行联系，并同意以电子方式接受真知码的信息。真知码将用电子邮件或通过在真知码上发布通知的方式与用户进行联系。用户同意真知码用电子方式提供给用户的所有协议、通知、披露和其他信息属于书面形式。如果真知码能够证明以电子形式的信息已经发送给用户或者真知码已在码上花软件上发布这样的通知，将被视为用户已收到所有协议、声明、披露和其他信息。真知码保留通过邮件和短信的形式，对本软件注册、购物用户发送订单信息、促销活动等告知服务的权利。如果用户访问真知码，或在真知码注册、购物，表明其已同意接受此项服务。若用户不希望接收真知码的邮件，请在邮件下方输入您的E-mail地址自助完成退阅； 若用户不希望接收真知码的短信，请提供手机号码联系真知码客服处理。</p>

<p class="mat20">4. 送货规则。真知码将会把商品送到用户指定的收货地址。所有在码上花软件上列出的送货时间皆为参考时间，供用户参照使用。参考送货时间是根据库存状况、正常的处理过程和送货时间、送货地点等情况计算得出的。</p>

<p class="mat20">5. 退换货规则。真知码保留对商品退换货规则的解释权和调整权。用户下订单即表明接受真知码的退换货规则。详情请参见退换货规则。</p>

<p class="mat20">6. 规则的变更：</p>

①真知码可以根据需要变更本协议所述的相关规则、条款和条件或用户资格的认定。 <br >对这些条款的修改和变更将被包含在真知码更新的规则中。上述变更具有可分割性，如果部分变更或条件被认定为无效的，不影响其他变更或条件的有效性。<br >

<p class="mat10">②用户在使用真知码提供的各项服务的同时，承诺接受并遵守各项相关规则的规定。真知码有权根据需要不时地制订、修改本协议及规则，并以软件公示的方式进行公告，不再单独通知用户。变更后的协议和规则一经在软件公布后，立即自动生效。如用户不同意相关变更，即应当立即停止使用码上花软件服务；若用户继续使用码上花软件服务的，即表示用户已接受经修订的协议和规则。</p>

<p class="mat20">7. 解除和终止：</p>

①用户在下列情况下，有权取消订单：<br >

a)经用户和真知码协商达成一致的；<br >

b)真知码就用户订单做出承诺之前；<br >

c)码上花软件上公布的商品价格发生变化或错误，用户在真知码发货之前通知真知码的。<br >

②真知码在下列情况下，有权取消用户订单：<br >

a)经用户和真知码协商达成一致的；<br >

b)码上花软件上显示的商品信息明显错误或缺货的；<br >

c)用户订单信息明显错误或超出真知码存货量；<br >

d)因不可抗力、真知码系统发生故障或遭受第三攻击，及其它真知码无法控制的情形；<br >

e)经真知码判断不符合公平和诚实信用原则的情形，如同一用户多次无理由拒收商品；<br >

f)按码上花软件规则可取消用户订单的其他情形。真知码可以终止全部或部分规则，即使真知码没有要求或强制用户严格遵守这些规则，也并不构成真知码对任何权利的放弃。<br >

<p class="mat20">8. 责任限制</p>

①在法律法规所允许的限度内，因使用真知码服务而引起的任何损害或经济损失，真知码承担的全部责任均不超过用户所购买的与该索赔有关的商品价格。这些责任限制条款将在法律所允许的最大限度内适用，并在用户资格被撤销或终止后仍继续有效。<br >

<p class="mat10">②真知码及其附属公司、投资方以及与其存在直接或间接股权关系的公司（以下统称“关联方”）不担保码上花软件提供给用户的全部信息或从码上花软件发出的电子信件没有病毒或其他有害成分。</p>

<p class="title mat20">七、服务的中断和终止：</p>

<p class="mat20">1. 如用户向真知码提出注销用户账号时，经真知码审核同意，由真知码注销该用户账号，用户即解除与真知码的服务协议关系。但注销该用户账号后，真知码仍保留下列权利：</p>

① 真知码有权保留该用户的注册信息及以前的交易行为记录；<br >

②如用户在注销前在码上花交易软件上存在违法行为或违反本协议的行为，真知码仍可行使本协议所规定的权利。<br >

<p class="mat20">2. 在下列情况下，真知码可以通过注销用户账户的方式终止服务：</p>

① 在用户违反本协议相关规定时，真知码有权终止向该用户提供服务。如该用户在真知码终止提供服务后，再一次直接或间接或以他人名义注册为真知码用户的，真知码有权再次单方面终止向该用户提供服务；<br >

<p class="mat10">② 如真知码通过用户提供的信息与用户联系时，发现用户在注册时填写的电子邮箱已不存在或无法接收电子邮件的，经真知码以其它联系方式通知用户更改，而用户在三个工作日内仍未能提供新的有效电子邮箱地址的，真知码有权终止向该用户提供服务；</p>

③ 一经真知码发现用户注册信息中的内容是虚假的，真知码有权随时终止向该用户提供服务；<br>

④ 本协议终止或更新时，用户明示不愿接受新的服务协议的；<br>

⑤ 其它真知码认为需终止服务的情况。<br >

<p class="title mat20">八、适用的法律和管辖权：</p>

本协议适用中华人民共和国的法律，所有的争端将诉诸于真知码所在地的人民法院。<br >

<p class="title mat20">九、版权：</p>

<p>1. 码上花软件上的图表、标识、网页页眉、按钮图标、文字、服务品名等标示在软件上的信息都是真知码及其关联方的财产，受中国和国际知识产权法的保护。未经真知码许可，任何人不得使用、复制或用作其他用途。在码上花软件上出现的其他商标是其商标权利人各自的财产。未经真知码或相关商标所有人的书面许可，任何第三方都不得使用上述标示在码上花软件上的信息。</p>

<p class="mat20">2. 真知码用户发表的文章仅代表作者本人观点，与真知码立场无关。作者文责自负。</p>

<p class="mat20">3. 真知码及其关联方有权将用户在本软件发表的商品使用体验、商品讨论或图片进行使用或者与其他人合作使用，使用范围包括但不限于软件、电子杂志、杂志、刊物等，使用时需为作者署名，以发表文章时注明的署名为准。文章有附带版权声明者除外。</p>

<p class="mat20">4. 用户在码上花软件上发表的文章及图片（包括转贴的文章及图片）版权仅归原作者所有，若作者有版权声明或原作从其它软件转载而附带有原版权声明者，其版权归属以附带声明为准。任何转载、引用发表于真知码的版权文章须符合以下规范：</p>

①用于非商业、非盈利、非广告性目的时需注明作者及文章及图片的出处为"真知码"。<br >

②用于商业、盈利、广告性目的时需征得文章或图片原作者的同意，并注明作者姓名、授权范围及原作出处"真知码"。<br >

③任何文章或图片的修改或删除均应保持作者原意并征求原作者同意，并注明授权范围。<br >

<p class="title mat20">十、信息保护：</p>

<p>	1. 用户个人隐私：请阅读真知码的隐私声明以了解隐私政策。该声明适用于您对真知码的访问，及在码上花购买商品或使用真知码提供的任何服务。</p>

<p class="mat20">2. 信息安全：</p>

① 真知码账户和提现功能有密码保护，请用户妥善保管账户及密码信息；<br >

② 如果用户发现自己的个人信息泄密，尤其是真知码账户及密码或提现密码发生泄露，请用户立即联络真知码客服，以便真知码采取相应措施。<br >

<p class="mat20">3. Cookie的使用规则：</p>

①通过真知码所设Cookie所取得的有关信息，将适用本规则；<br >

②编辑和删除个人信息的权限：用户可以点击“我的”对用户的个人信息进行编辑和删除，除非真知码另有规定。<br >

<p class="title mat20">十一、隐私声明：</p>

<p>码上花软件由真知码运营并由其关联公司提供各种支持。</p>

<p class="mat20">真知码注重对您个人隐私的保护。有时候真知码需要某些信息才能为您提供您请求的服务，本隐私声明解释了这些情况下的数据收集和使用情况。本隐私声明适用于本软件的所有相关服务。如果您访问本软件、使用本软件的任何服务，那么您便接受了本隐私声明。 客户信息的获取。</p>

<p class="mat20">真知码获取客户信息的主要目的在于向您提供一个顺畅、高效的购物体验，并致力于不断完善和提升您的体验。</p>

<p class="mat20">真知码可能获取的客户信息类型包括：注册信息（如，用户名、或在注册过程中提供的信息）。</p>

<p>● 个人或公司联系方式（如，姓名、公司名称、真实地址、电邮地址、电话、手机号码、传真号码）。</p>

● 订购信息（如，(i) 订购人和收货人名称、真实地址、电邮地址和电话号码等与订购相关的任何信息，(ii) 在交付文件上的签名，(iii) 码上花帐号及帐号信息，(iv) 为帮助真知码提供服务（包括特定服务）而提供给真知码的信息。）。<br >

● 用于您身份识别的信息（如，身份证号码、护照号码、驾驶证号码）。<br >

● 指示真知码将商品或服务提供给其他人士时提供的该人士的有关信息（如该人士的姓名、电邮地址和电话号码）。<br >

● 支付信息（包括但不限于支付详情或在线支付服务信息和账单寄送地址）和财务信息（如，银行账号）。<br >

● 其他个人、公司、单位、或社会实体信息。<br >

<p class="mat20">真知码可能会就下列各种情况，获得您的客户信息：</p>

● 您在访问或使用本软件服务时提供的信息<br >

● 您在与真知码的沟通中自动获取的信息：无论您何时与真知码沟通，真知码接收并储存的信息。<br >

● 从其他来源获取的信息：如您参加真知码或真知码与合作伙伴组织的任何活动。<br >

<p class="mat20">顾客信息的使用</p>

<p>真知码可能会利用获取的顾客信息：</p>

● 向您提供所需要的产品或服务（如，定向采购、货物配送）<br >

● 处理和收取款项<br >

● 就您的要求向您提供咨询服务，或向您做出回应或与您沟通<br >

● 向您提供真知码认为您可能会感兴趣的产品或服务<br >

● 为提升真知码的服务，联系您进行调研<br >

● 进行数据分析（如，购买行为或趋势分析、市场或顾客调查、财务分析）<br >

● 管理或认可您参加各种活动的资格，如线上或线下活动、优惠或促销活动<br >

● 经营、评估和完善真知码的业务（包括开发新产品和服务；管理真知码的通信；判断真知码的销售、营销和广告效果；分析和强化真知码的产品、服务和软件；和开展会计、审计、记账、对账和收集活动）<br >

● 在事先获得您同意的情况下，向您指定的联系人发送信息<br >

● 防止各种违法或犯罪活动和其他法律责任<br >

● 遵守法律规定和真知码的政策规则<br >

顾客信息的共享、披露与转让<br >

客户的信息是真知码业务的重要组成部分，真知码不会出售或以其他方式共享您的个人信息，但本《隐私声明》中已列明的情况除外。<br >

● 合作伙伴：<br >

<p class="mat20">真知码可能会与真知码的关联公司或合作伙伴（包括但不限于，您通过真知码提供的联合登陆方式登陆的其它软件，以下统称“合作伙伴”）共享顾客信息。您可以辨别您的交易何时会涉及真知码的合作伙伴，真知码会与该合作伙伴分享与这些交易有关的客户信息。</p>
		  </div>
	</section>

</template>
<script>
import headerSection from '@/components/headerSection';
  export default {
    data() {
      return {
      	
      }
    },
    components: {
            headerSection
    },
    methods: {
		 
    },
    mounted() {

 	}
  }

</script>

<style lang="scss" scoped>
.protocol{
	padding:20px;
	font-size:24px;
	line-height:45px;
	.title{
		font-size:28px;
		font-weight: bold;
	}
	.mat20{
		margin-top: 20px;
	}
	.mat10{
		margin-top: 10px;
	}
}	


</style>
